Res-media/Res-firecracker-random-v1/firecracker_t_10_c_30_composeReviewServiceCore_8_wrkVcpu_2/wrk.txt
Running 1m test @ http://nginx-web-server:8080/wrk2-api/review/compose
  10 threads and 30 connections
  Thread calibration: mean lat.: 1643.155ms, rate sampling interval: 5554ms
  Thread calibration: mean lat.: 1226.733ms, rate sampling interval: 5193ms
  Thread calibration: mean lat.: 1620.050ms, rate sampling interval: 5570ms
  Thread calibration: mean lat.: 1597.536ms, rate sampling interval: 5619ms
  Thread calibration: mean lat.: 1642.367ms, rate sampling interval: 5693ms
  Thread calibration: mean lat.: 1151.210ms, rate sampling interval: 3827ms
  Thread calibration: mean lat.: 905.679ms, rate sampling interval: 3268ms
  Thread calibration: mean lat.: 910.700ms, rate sampling interval: 3821ms
  Thread calibration: mean lat.: 1243.960ms, rate sampling interval: 4558ms
  Thread calibration: mean lat.: 1347.981ms, rate sampling interval: 4919ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.28s     1.02s    3.94s    60.67%
    Req/Sec     2.04      6.51    27.00     90.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.58s 
 75.000%    3.17s 
 90.000%    3.45s 
 99.000%    3.94s 
 99.900%    4.08s 
 99.990%    4.48s 
 99.999%    4.48s 
100.000%    4.48s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      95.359     0.000000            1         1.00
     865.279     0.100000           99         1.11
    1189.887     0.200000          198         1.25
    1441.791     0.300000          296         1.43
    2031.615     0.400000          394         1.67
    2584.575     0.500000          492         2.00
    2740.223     0.550000          542         2.22
    2863.103     0.600000          591         2.50
    2965.503     0.650000          640         2.86
    3059.711     0.700000          689         3.33
    3174.399     0.750000          738         4.00
    3219.455     0.775000          764         4.44
    3266.559     0.800000          788         5.00
    3297.279     0.825000          814         5.71
    3330.047     0.850000          838         6.67
    3385.343     0.875000          862         8.00
    3416.063     0.887500          875         8.89
    3446.783     0.900000          886        10.00
    3485.695     0.912500          898        11.43
    3528.703     0.925000          911        13.33
    3579.903     0.937500          923        16.00
    3627.007     0.943750          929        17.78
    3661.823     0.950000          935        20.00
    3674.111     0.956250          941        22.86
    3690.495     0.962500          949        26.67
    3721.215     0.968750          954        32.00
    3731.455     0.971875          957        35.56
    3756.031     0.975000          960        40.00
    3835.903     0.978125          963        45.71
    3895.295     0.981250          966        53.33
    3913.727     0.984375          969        64.00
    3936.255     0.985938          972        71.11
    3936.255     0.987500          972        80.00
    3944.447     0.989062          974        91.43
    3960.831     0.990625          975       106.67
    3975.167     0.992188          977       128.00
    4014.079     0.992969          978       142.22
    4014.079     0.993750          978       160.00
    4026.367     0.994531          979       182.86
    4034.559     0.995313          980       213.33
    4046.847     0.996094          981       256.00
    4046.847     0.996484          981       284.44
    4046.847     0.996875          981       320.00
    4059.135     0.997266          982       365.71
    4059.135     0.997656          982       426.67
    4081.663     0.998047          983       512.00
    4081.663     0.998242          983       568.89
    4081.663     0.998437          983       640.00
    4081.663     0.998633          983       731.43
    4081.663     0.998828          983       853.33
    4476.927     0.999023          984      1024.00
    4476.927     1.000000          984          inf
#[Mean    =     2280.268, StdDeviation   =     1022.718]
#[Max     =     4472.832, Total count    =          984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12518 requests in 1.00m, 2.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 587
  Non-2xx or 3xx responses: 37
Requests/sec:    208.52
Transfer/sec:     37.57KB